# URL Ref: https://github.com/Homebrew/homebrew-bundle
# ====================================================

cask_args appdir: "/Applications"

tap "aws/tap"
tap "danielbayley/adobe"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/portable-ruby"
tap "powershell/tap"
tap "romkatv/powerlevel10k"
tap "mas-cli/tap"
tap "molovo/revolver"
tap "phrase/brewed"
tap "railwaycat/emacsmacport"

cask "osxfuse"

cask "java"
brew "javarepl"
brew "wget"

# Search tool like grep, but optimized for programmers
brew "ack"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Official Amazon AWS command-line interface
brew "awscli"
brew "aws-sam-cli"

# Search tool like grep, but optimized for programmers
brew "ack"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Completion for Atom Package Manager
brew "apm-bash-completion"
# Apache Portable Runtime library
brew "apr"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Core application library for C
brew "glib"
brew "gcc"
# Automatic configure script builder
brew "autoconf"
# Per-project, per-directory shell environments
brew "autoenv"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Text processing scripting language
brew "awk"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2", link: false
# GNU binary tools for native development
brew "binutils"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Vector graphics library with cross-device output support
brew "cairo"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Provides SOCKS and HTTPS proxy support to SSH
brew "connect"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Reimplementation of ctags(1)
brew "ctags"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Apply a diff file to an original
brew "gpatch"
# Debian package management system
brew "dpkg"
# Library and utilities for processing GIFs
brew "giflib"
# OpenType text shaping engine
brew "harfbuzz"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# Compression/decompression library aiming for high speed
brew "snappy"
brew "highlight"
# Classic UNIX line editor
brew "ed", link: true
# Next-gen compiler infrastructure
brew "llvm"
# Emacs plugin using libclang to complete C/C++ code
brew "emacs-clang-complete-async"
# Utility to determine file types
brew "file-formula"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Generic library support script
brew "libtool"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Stores Git credentials for Visual Studio Team Services
brew "git-credential-manager"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# AVH edition of git-flow
brew "git-flow-avh"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Proxy for serving git repositories over SSH
brew "git-ssh"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU implementation of which utility
brew "gnu-which"
# Assuan IPC Library
brew "libassuan"
# Pragmatic language for the JVM
brew "gosu"
# GNU PIC Utilities
brew "gputils"
# GNU grep, egrep and fgrep
brew "grep"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Popular GNU data compression program
brew "gzip"
brew "libmpc"
# Program providing model for GNU coding standards and practices
brew "hello"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# String tool
brew "intltool"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Port-knock server
brew "knock"
# Bash completion for Launchctl
brew "launchctl-completion"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Multi-format archive and compression library
brew "libarchive"
# EXIF parsing library
brew "libexif"
# 2D game development library
brew "libgosu"
# Library for Apple Binary- and XML-Property Lists
brew "libplist"
# Postgres C API library
brew "libpq"
# C implementation of a Sass compiler
brew "libsass"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# YAML Parser
brew "libyaml"
# Macro processing language
brew "m4"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Utility for directing compilation
brew "make"
# System to create Windows installers
brew "makensis"
# Scalable distributed version control system
brew "mercurial"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Virtual machine for NQP and Rakudo Perl 6
brew "moarvm"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line collection runner for Postman
brew "newman"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Manage compile and link flags for libraries
brew "pkg-config"
# pgrep, pkill, and pfind for OpenBSD and Darwin (macOS)
brew "proctools"
# Progress: Coreutils Progress Viewer
brew "progress"
# Implementation of Telnet and SSH
brew "putty"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Implementation of the AT&T Plan 9 shell
brew "rc"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Airtunes emulator
brew "shairport"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Shell completion for Tmuxinator
brew "tmuxinator-completion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Convert TTF files to EOT
brew "ttf2eot"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# Utilities for interacting with PyPI
brew "twine-pypi"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# GTK+ dialog boxes for the command-line
brew "zenity"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Debugger for zsh
brew "zshdb"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# SSL/TLS cryptography library
brew "homebrew/portable-ruby/portable-openssl"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"

cask "adoptopenjdk8"
cask "chromedriver"
cask "emacs-mac"
cask "exmancmd"
cask "gpg-suite"
cask "gulp"
cask "macvim"

# cask "font-fira-code"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-powerline-symbols"
cask "font-source-code-pro"

cask "movist-pro"
cask "plistedit-pro"
cask "oracle-jdk-javadoc"
cask "powershell"
cask "pycharm"
cask "suspicious-package"
# Adobe extensions installer
cask "zxpinstaller"

mas "BetterSnapTool", id: 417375580
mas "HP Smart", id: 1474276998
mas "Keka", id: 470158793
mas "Simplenote", id: 692867256
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
mas "YI Home", id: 1215244636