# URL Ref: https://github.com/Homebrew/homebrew-bundle
# ====================================================

cask_args appdir: "/Applications"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git", pin: true
tap "caskroom/fonts"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "molovo/revolver"
tap "phrase/brewed"
tap "railwaycat/emacsmacport"
tap "sambadevi/powerlevel9k"
tap "zunit-zsh/zunit"
tap "weaveworks/tap"
tap "aws/tap"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "osxfuse"
# Search tool like grep, but optimized for programmers
brew "ack"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Completion for Atom Package Manager
brew "apm-bash-completion"
# Apache Portable Runtime library
brew "apr"
# Official Amazon AWS command-line interface
brew "awscli"
brew "aws-sam-cli"
# SSL/TLS cryptography library
brew "openssl"
brew "cocoapods"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Per-project, per-directory shell environments
brew "autoenv"
# Shell extension to jump to frequently used directories
brew "autojump"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Text processing scripting language
brew "awk"
# GNU database manager
brew "gdbm"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion", link: false
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Install pip packages as homebrew formulae
brew "brew-pip"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU multiple precision arithmetic library
brew "gmp"
# C string library for manipulating Unicode strings
brew "libunistring"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Provides SOCKS and HTTPS proxy support to SSH
brew "connect"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Load/unload environment variables based on $PWD
brew "direnv"
# Debian package management system
brew "dpkg"
# Codegen for Echoprint
brew "echoprint-codegen"
# Emacs plugin using libclang to complete C/C++ code
brew "emacs-clang-complete-async"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Generic library support script
brew "libtool"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Distributed revision control system
brew "git", link: false
# Stores Git credentials for Visual Studio Team Services
brew "git-credential-manager"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# AVH edition of git-flow
brew "git-flow-avh"
# Proxy for serving git repositories over SSH
brew "git-ssh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Assuan IPC Library
brew "libassuan"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# GNU PIC Utilities
brew "gputils"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Haskell source code suggestions
brew "hlint"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Port-knock server
brew "knock"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Bash completion for Launchctl
brew "launchctl-completion"
# Input filter for the pager less
brew "lesspipe"
# Multi-format archive and compression library
brew "libarchive"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library for Apple Binary- and XML-Property Lists
brew "libplist"
# C implementation of a Sass compiler
brew "libsass"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# YAML Parser
brew "libyaml"
# GUI for vim, made for macOS
brew "macvim", link: false
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Cross platform, open source .NET development framework
brew "mono"
# A simple and efficient MsgPack binary serialization library
brew "msgpuck"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql"
# pgrep, pkill, and pfind for OpenBSD and Darwin (macOS)
brew "proctools"
# Progress: Coreutils Progress Viewer
brew "progress"
# Implementation of Telnet and SSH
brew "putty"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Implementation of the AT&T Plan 9 shell
brew "rc"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Airtunes emulator
brew "shairport"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Bring your .bashrc, .vimrc, etc. with you when you SSH
brew "sshrc"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Shell completion for Tmuxinator
brew "tmuxinator-completion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Convert TTF files to EOT
brew "ttf2eot"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# Vi 'workalike' with many additional features
brew "vim", link: false
brew "weaveworks/tap/eksctl"
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# GTK+ dialog boxes for the command-line
brew "zenity"
# UNIX shell (command interpreter)
brew "zsh"
# Debugger for zsh
brew "zshdb"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Fonts
# A badass zsh theme with more power than a normal earthling
brew "sambadevi/powerlevel9k/powerlevel9k"
cask "homebrew/cask-fonts/font-fira-code"
cask "homebrew/cask-fonts/font-hack-nerd-font"
cask "homebrew/cask-fonts/font-inconsolata"
cask "homebrew/cask-fonts/font-powerline-symbols"
cask "homebrew/cask-fonts/font-source-code-pro"

# Tool for automated testing of webapps across many browsers
cask "chromedriver"
cask "alfred"
cask "cheatsheet"
cask "docker-toolbox"
cask "google-drive-file-stream"
cask "google-hangouts"
cask "macvim"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "virtualbox"
cask "webpquicklook"
cask "railwaycat/emacsmacport/emacs-mac"
cask "homebrew/cask-versions/adoptopenjdk8"

# Pragmatic language for the JVM
brew "gosu"

mas "BetterSnapTool", id: 417375580
mas "Desktop Verse", id: 572304633
mas "Earth 3D", id: 476566660
mas "GIF Brewery 3", id: 1081413713
mas "Simplenote", id: 692867256
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
mas "YiHomeMac International", id: 1215244636
