# URL Ref: https://github.com/Homebrew/homebrew-bundle
# ====================================================

tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "molovo/revolver"
tap "phrase/brewed"
tap "railwaycat/emacsmacport"
tap "sambadevi/powerlevel9k"
tap "zunit-zsh/zunit"


# Search tool like grep, but optimized for programmers
brew "ack"
# Apache Portable Runtime library
brew "apr"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Per-project, per-directory shell environments
brew "autoenv"
brew "autojump"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Text processing scripting language
brew "awk"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Install pip packages as homebrew formulae
brew "brew-pip"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Provides SOCKS and HTTPS proxy support to SSH
brew "connect"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Load/unload environment variables based on $PWD
brew "direnv"
# Debian package management system
brew "dpkg"
# Codegen for Echoprint
brew "echoprint-codegen"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Monitor a directory for changes and run a shell command
brew "fswatch"
brew "gdbm"
# Comprehensive Library for Galois Field Arithmetic
brew "gf-complete"
brew "git"
# Stores Git credentials for Visual Studio Team Services
brew "git-credential-manager"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# AVH edition of git-flow
brew "git-flow-avh"
# Proxy for serving git repositories over SSH
brew "git-ssh"
# The official GitLab CI runner written in Go
brew "gitlab-runner"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
brew "golang"
# Pragmatic language for the JVM
brew "gosu"
# GNU PIC Utilities
brew "gputils"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Java-based scripting language
brew "groovy"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Haskell source code suggestions
brew "hlint"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Port-knock server
brew "knock"
brew "kubernetes-cli"
# Bash completion for Launchctl
brew "launchctl-completion"
# Input filter for the pager less
brew "lesspipe"
brew "libarchive"
# 2D game development library
brew "libgosu"
# Library for Apple Binary- and XML-Property Lists
brew "libplist"
# C implementation of a Sass compiler
brew "libsass"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
brew "macvim", args: ["--env-std", "--with-override-system-vim"]
# Utility for directing compilation
brew "make"
# Scalable distributed version control system
brew "mercurial"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Cross platform, open source .NET development framework
brew "mono"
# A simple and efficient MsgPack binary serialization library
brew "msgpuck"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node", link: false
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Swiss-army knife of markup format conversion
brew "pandoc"
brew "pcre"
# Pinentry for GPG on Mac
brew "pinentry-mac"
brew "pkill"
# Object-relational database system
brew "postgresql"
# Progress: Coreutils Progress Viewer
brew "progress"
# Implementation of Telnet and SSH
brew "putty"
# Monitor data's progress through a pipe
brew "pv"
# Ruby version manager
brew "rbenv"
# Switch between rubies without reference to patch levels
brew "rbenv-use"
# Implementation of the AT&T Plan 9 shell
brew "rc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Airtunes emulator
brew "shairport"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Bring your .bashrc, .vimrc, etc. with you when you SSH
brew "sshrc"
# A recursive directory listing command that produces a depth indented listing of files.
brew "tree"
# Terminal multiplexer
brew "tmux"
# Convert TTF files to EOT
brew "ttf2eot"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
brew "vim"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn", args: ["without-node"]
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Debugger for zsh
brew "zshdb"



cask "alfred"
cask "betterzipql"
cask "cheatsheet"
cask "docker"
cask "dropbox"
cask "docker-toolbox"
cask "emacs-mac"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-powerline-symbols"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-drive"
cask "google-hangouts"
cask "iterm2"
cask "java8"
cask "minikube"
cask "osxfuse"
cask "pdftk"
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "sublime-text"
cask "suspicious-package"
cask "virtualbox"
cask "webpquicklook"