tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/services"
tap "linuxbrew/extra"
tap "linuxbrew/xorg"
tap "molovo/revolver"
tap "phrase/brewed"
tap "railwaycat/emacsmacport"
tap "sambadevi/powerlevel9k"
tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git"
tap "zunit-zsh/zunit"
# Search tool like grep, but optimized for programmers
brew "ack"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Completion for Atom Package Manager
brew "apm-bash-completion"
# Library for command-line editing
brew "readline"
# General-purpose lossless data-compression library
brew "zlib"
# Apache Portable Runtime library
brew "apr"
# Bash completion for Aptly
brew "aptly-completion"
# Per-project, per-directory shell environments
brew "autoenv"
# GNU multiple precision arithmetic library
brew "gmp"
# Generic library support script
brew "libtool"
# C string library for manipulating Unicode strings
brew "libunistring"
# Shell extension to jump to frequently used directories
brew "autojump"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Install pip packages as homebrew formulae
brew "brew-pip"
# (Arguably) the best yacc variant
brew "byacc"
# Vector graphics library with cross-device output support
brew "cairo"
# Emacs dependency management
brew "cask"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Object-relational database system
brew "postgresql"
# Monitor Postgres databases
brew "check_postgres"
# Cross-platform make
brew "cmake"
# Provides SOCKS and HTTPS proxy support to SSH
brew "connect"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Load/unload environment variables based on $PWD
brew "direnv"
# Debian package management system
brew "dpkg"
# Distributed revision control system
brew "git", link: false
# Stores Git credentials for Visual Studio Team Services
brew "git-credential-manager"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# AVH edition of git-flow
brew "git-flow-avh"
# Proxy for serving git repositories over SSH
brew "git-ssh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU PIC Utilities
brew "gputils"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Input filter for the pager less
brew "lesspipe"
# Assuan IPC Library
brew "libassuan"
# Asynchronous event library
brew "libevent"
# Powerful, lightweight programming language
brew "lua"
# Utility for directing compilation
brew "make"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Terminal multiplexer
brew "tmux"
